In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("train.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Cabin        202 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.5+ KB

In [4]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

### Cabin column can be dropped, many values are missing

In [5]:
data=data.drop(["Cabin"],axis=1)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

### Dropping Irrelevent columns

In [7]:
data.drop(['PassengerId','Name','Ticket'], axis=1, inplace=True)

In [8]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

### Changing Text data to Categorical

In [9]:
from sklearn.preprocessing import LabelEncoder
lab = LabelEncoder()

data["Sex"] = lab.fit_transform(data["Sex"])
data["Embarked"] = lab.fit_transform(data["Embarked"])

In [10]:
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

### Spliting Data into Dependent Variable and Independent variable

In [12]:
y = data.iloc[:,:1]
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [13]:
X = data.drop(["Survived"],axis=1)
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

In [19]:
from sklearn import tree
model = tree.DecisionTreeClassifier(max_depth=14)
model.fit(X,y)

DecisionTreeClassifier(max_depth=14)

### Predicting score

In [20]:
model.score(X,y)

0.968503937007874

### Applying Random Forest

In [23]:
from sklearn import tree
from sklearn import preprocessing
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier(n_estimators=1000, max_features=2, oob_score=True)
rf.fit(X,y)

<ipython-input-23-bf34980b807e>:5: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf.fit(X,y)

RandomForestClassifier(max_features=2, n_estimators=1000, oob_score=True)

### Check the score

In [24]:
rf.oob_score_

0.8042744656917885

### Finding Most Relevent Column for predicting Person Survived or not

In [25]:
a = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare','Embarked']
for feature,imp in zip(a, rf.feature_importances_):
    print(feature,"=> :",imp);

Pclass => : 0.08441585690565537
Sex => : 0.26026239944659596
Age => : 0.2566233099494638
SibSp => : 0.050537431672662614
Parch => : 0.04003856083632614
Fare => : 0.2727989233408811
Embarked => : 0.0353235178484151

### Inference:
Pclass, Sex , Age, Fare have value more than 0.05 ie, They are Important feature and affect the prediction of Survived Persons

In [26]:
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

### Spliting Dataset according to Important Columns

In [28]:
x = data[['Age', 'Sex', 'Fare','Pclass']]
x.head()

    Age  Sex     Fare  Pclass
0  22.0    1   7.2500       3
1  38.0    0  71.2833       1
2  26.0    0   7.9250       3
3  35.0    0  53.1000       1
4  35.0    1   8.0500       3

### Fitting decision tree

In [30]:
model = tree.DecisionTreeClassifier(max_depth=8)
model.fit(x,y)

DecisionTreeClassifier(max_depth=8)

In [34]:
with open('Titanic_tree.dot','w') as f:
    f = tree.export_graphviz(model, feature_names=['Age', 'Sex', 'Fare','Pclass'], out_file=f);

<img src="tree_titanic.png" width="800" />

In [32]:
model.score(x,y)

0.8965129358830146

### Fitting Random Forest

In [47]:
from warnings import filterwarnings
filterwarnings('ignore')
rf.fit(x,y)

RandomForestClassifier(max_features=2, n_estimators=1000, oob_score=True)

In [46]:
rf.oob_score_

0.8200224971878515

### Inference drawn

__The Accuracy score increases while predicting on Important Columns than predicting on All Columns__


Note

There are many more leaf nodes in the obtained decision tree and only few such references are mentioned below.

Leaf node inferences

1 female passenger with fare greater than 48.2 Dollars and age less than 8 years did'nt survived.

8 male passengers with age less than 6.5 years and fare less than 20.82 dollars survived.

4 male passengers with age greater than 6.5 years and fare less than 26.46 dollars survived.

2 male passengers with age greater than 6.5 years and fare greater than 387.66 dollars survived.

4 female passengers with fare less than 28.85 dollars did'nt survived.

2 male passengers with age less than 6.5 years and fare greater than 64.37 dollars survived.

2 female passengers with fare greater than 44.24 dollars did'nt survived.

22 female passengers with fare less than 69.42 dollars and age greater than 8 years survived.

3 female passengers with fare greater than 69.42 dollars and age greater than 8 years didn't survived.

45 female passengers with fare less than 70.27 dollars and age greater than 25.5 years survived.

3 male passengers with age greater than 3.5 years and fare less than than 64.37 dollars didn't survived.

### Prediction on Test DataSet

In [48]:
test_data = pd.read_csv('test.csv')

In [49]:
test_data.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [51]:
data2 = test_data.drop(['Name','PassengerId','Ticket'],axis=1)

In [52]:
le = LabelEncoder()

data2["Sex"] = le.fit_transform(data2["Sex"])
data2["Embarked"] = le.fit_transform(data2["Embarked"])

In [54]:
imp = data2[['Age', 'Sex', 'Fare','Pclass']]
imp.head()

    Age  Sex     Fare  Pclass
0  34.5    1   7.8292       3
1  47.0    0   7.0000       3
2  62.0    1   9.6875       2
3  27.0    1   8.6625       3
4  22.0    0  12.2875       3

In [55]:
y_pred = model.predict(imp)

In [56]:
y_pred

array([0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1,
       0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0,
       0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

In [57]:
result = pd.DataFrame({'PassengerId': test_data['PassengerId'], 'Survived': y_pred })

In [58]:
result

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         0
..           ...       ...
412         1305         0
413         1306         1
414         1307         0
415         1308         0
416         1309         0

[417 rows x 2 columns]

In [59]:
result.to_csv('TitanicPrediction.csv', index=False)

### Final predicted output is

In [61]:
output = pd.read_csv('TitanicPrediction.csv')
output.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         0